Repository: XTY64XTY/Xdows-Security-5
Catalog: Xdows-Security/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans, zh_hant

# SettingsPage_Scan_Cloud_Disclaimer_Text
source: Once you enable this engine, using it to scan files will send the file data or its information to the servers of the corresponding cloud service provider. Users should consciously comply with relevant service agreements, treaties, or declarations, and should not send files involving relevant laws or privacy. Any issues or losses such as file leaks caused by this engine shall be borne by the cloud service provider, and the software developer shall not assume any responsibility. The software developer also shall not be responsible for any loss of files or data resulting from force majeure events, such as server failures. This statement or the cloud service agreement, treaty, or declaration may be modified, deleted, or supplemented due to software updates or other factors. In case of disputes, the latest version shall prevail. The software developer reserves the right to revise, delete, or supplement this statement without the user's consent, and the final interpretation right of this statement belongs to the software developer. The original developer of this software (Xdows Software) bears no responsibility for any problems arising from branches of this software. By using this engine in any manner, you agree to and accept this statement. In the event of any form of dispute, the Chinese version of the disclaimer shall prevail. If you do not accept it, please turn off the engine, or stop using and delete the software.
zh_hans: 当您启用此引擎后， 使用该引擎进行扫描文件时会将文件数据或其信息发送对应云服务提供商服务器。 用户应自觉遵守相关服务协议、条约或声明，不发送涉及相关法律和隐私文件。 任何由此引擎引发的文件泄露等问题或损失均由云服务提供商承担，此软件开发者不承担任何责任。 因不可抗力因素如服务器故障等问题而引发的数据丢失等文件或损失，此软件开发者同样不承担任何责任。 本声明或云服务提供协议、条约或声明会因软件更新等多种因素进行修改、删除、补充其内容，当发生纠纷时，请以最新版本为准， 本软件开发者具有对此声明进行修改、删除、补充而不经用户同意的权力，该声明最终解释权归本软件开发者所有。 对于此软件的分支产生的问题，此软件的源开发者（Xdows Software、零度枫铸）不承担任何责任。 当您通过任何方式使用该引擎时则表示同意并接受该声明，如果您不接受请自行关闭此引擎或停止使用并删除该软件。

# SecurityPage_MenuItem_Trust.Text
source: Trust File
zh_hans: 信任文件
zh_hant: 信任文件

# SecurityPage_MenuItem_Handle.Text
source: Handle File
zh_hans: 处理文件
zh_hant: 處理文件

# SecurityPage_TrustConfirm_Title
source: Trust File
zh_hans: 信任文件
zh_hant: 信任文件

# SecurityPage_TrustConfirm_Content
source: Are you sure you want to add this file to the trust area? {0} will no longer be detected as a threat by the scan engine.
zh_hans: 确定要将此文件添加到信任区吗？{0} 将不再被扫描引擎检测为威胁。
zh_hant: 確定要將此文件添加到信任區嗎？{0} 將不再被掃描引擎檢測爲威脅。

# SecurityPage_TrustConfirm_Primary
source: Trust
zh_hans: 信任
zh_hant: 信任

# SecurityPage_TrustResult_Title
source: Trust Successful
zh_hans: 信任成功
zh_hant: 信任成功

# SecurityPage_TrustResult_Content
source: File {0} has been successfully added to the trust area and will no longer be detected as a threat.
zh_hans: 文件 {0} 已成功添加到信任区，将不再被检测为威胁。
zh_hant: 文件 {0} 已成功添加到信任區，將不再被檢測爲威脅。

# SecurityPage_TrustFailed_Title
source: Trust Failed
zh_hans: 信任失败
zh_hant: 信任失敗

# SecurityPage_TrustFailed_Content
source: Failed to add file to trust area. Please check if the file exists or if permissions are sufficient.
zh_hans: 添加文件到信任区失败，请检查文件是否存在或权限是否足够。
zh_hant: 添加文件到信任區失敗，請檢查文件是否存在或權限是否足夠。

# SecurityPage_HandleConfirm_Title
source: Handle File
zh_hans: 处理文件
zh_hant: 處理文件

# SecurityPage_HandleConfirm_Content
source: Are you sure to handle this file {0}
zh_hans: 确定要处理此文件 {0}
zh_hant: 確定要處理此文件 {0}

# SecurityPage_HandleConfirm_Primary
source: Handle
zh_hans: 处理
zh_hant: 處理

# SecurityPage_HandleAction_Quarantined
source: File has been successfully quarantined
zh_hans: 文件已成功隔离
zh_hant: 文件已成功隔離

# SecurityPage_HandleAction_Deleted
source: File has been successfully deleted
zh_hans: 文件已成功删除
zh_hant: 文件已成功刪除

# SecurityPage_HandleAction_Renamed
source: File has been renamed to: {0}
zh_hans: 文件已重命名为：{0}
zh_hant: 文件已重命名爲：{0}

# SecurityPage_HandleAction_Failed
source: Failed to handle file
zh_hans: 处理文件失败
zh_hant: 處理文件失敗

# SecurityPage_HandleAction_ZipEntriesDeleted
source: Deleted {0} entries from archive
zh_hans: 已从压缩包中删除 {0} 个文件
zh_hant: 已從壓縮包中刪除 {0} 個文件

# SecurityPage_HandleAction_ZipEntriesQuarantined
source: Quarantined {0} files and deleted {1} entries from archive
zh_hans: 已隔离 {0} 个文件并从压缩包中删除 {1} 个条目
zh_hant: 已隔離 {0} 個文件並從壓縮包中刪除 {1} 個條目

# SecurityPage_HandleResult_Title
source: Handle Result
zh_hans: 处理结果
zh_hant: 處理結果

# SecurityPage_HandleFailed_Title
source: Handle Failed
zh_hans: 处理失败
zh_hant: 處理失敗

# SecurityPage_HandleAllButtonText.Text
source: Handle All
zh_hans: 一键处理

# SecurityPage_HandleAllConfirm_Title
source: Handle All Threats
zh_hans: 一键处理确认

# SecurityPage_HandleAllConfirm_Content
source: Are you sure you want to handle all {0} threat files? Files can be restored from quarantine after handling. Some files may be deleted directly.
zh_hans: 确定要处理所有 {0} 个威胁文件吗？ 处理完成后可在隔离区恢复该文件，部分文件可能会直接删除

# SecurityPage_HandleAllConfirm_Primary
source: Handle
zh_hans: 处理

# SecurityPage_HandleAllResult_Title
source: Handling Complete
zh_hans: 处理完成

# SecurityPage_HandleAllResult_Success
source: Successfully handled {0} file(s)
zh_hans: 成功处理 {0} 个文件

# SecurityPage_HandleAllResult_FailedHeader
source: The following files failed to handle:
zh_hans: 以下文件处理失败：

# SecurityPage_HandleAllResult_AllFailed_Title
source: Handling Failed
zh_hans: 处理失败

# SecurityPage_HandleAllResult_FailedTip
source: Failed threats remain in the list and can be handled individually
zh_hans: 失败的威胁将保留在列表中，可单独处理

# Common_OperationSuccess
source: Operation Successful
zh_hans: 操作成功
zh_hant: 操作成功

# Common_OperationFailed
source: Operation Failed
zh_hans: 操作失败
zh_hant: 操作失敗

# Common_Cancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# AllPage_Status
source: Enabled,Disabled
zh_hans: 已启用,已禁用

# SettingsPage_Other_Tray.Header
source: Notification area icon
zh_hans: 托盘图标

# SettingsPage_Other_Tray.Description
source: Show the icon in the notification area
zh_hans: 在任务栏中显示托盘图标

# SettingsPage_Other_Startup.Header
source: Run on Startup
zh_hans: 开机自启

# SettingsPage_Other_Startup.Description
source: Automatically start when the system boots
zh_hans: 在系统开机时自动启动

# TrayMenu_Open
source: Open
zh_hans: 打开
zh_hant: 打開

# TrayMenu_Quit
source: Quit
zh_hans: 退出
zh_hant: 退出

# MainWindow_CloseConfirmation_Title
source: Quit Xdows Security?
zh_hans: 退出 Xdows Security？

# MainWindow_CloseConfirmation_Content
source: Protection will stop after Xdows Security exits. Confirm that you want to quit.
zh_hans: 退出 Xdows Security 后防护将停止。请确认是否退出。

# TrayMenu_Settings
source: Settings
zh_hans: 设置
zh_hant: 設置

# SettingsPage_Appearance_BackgroundImage.Header
source: Background Image
zh_hans: 背景图片
zh_hant: 背景圖片

# SettingsPage_Appearance_BackgroundImage.Description
source: Set the background image for this software
zh_hans: 设置该软件的背景图片
zh_hant: 設置該軟件的背景圖片

# SettingsPage_Appearance_BackgroundImage_ClearButton.Content
source: Clear
zh_hans: 清空
zh_hant: 清空

# SettingsPage_Appearance_BackgroundImage_SelectButton.Content
source: Select
zh_hans: 选择
zh_hant: 選擇

# SettingsPage_Appearance_BackgroundImageOpacity.Header
source: Image Opacity
zh_hans: 图片透明
zh_hant: 圖片透明

# SettingsPage_Appearance_BackgroundImageOpacity.Description
source: Set the opacity of the background image
zh_hans: 设置背景图片的不透明
zh_hant: 設置背景圖片的不透明

# SettingsPage_BackgroundImage_Error_Title
source: Error
zh_hans: 错误
zh_hant: 錯誤

# SettingsPage_BackgroundImage_SelectError_Content
source: Failed to set background image: {0}
zh_hans: 无法设置背景图片: {0}
zh_hant: 無法設置背景圖片: {0}

# SettingsPage_BackgroundImage_ClearError_Content
source: Failed to clear background image: {0}
zh_hans: 无法清空背景图片: {0}
zh_hant: 無法清空背景圖片: {0}

# Button_Close
source: Close
zh_hans: 关闭
zh_hant: 關閉

# SettingsPage_Scan_IndexMode.Header
source: IndexMode
zh_hans: 索引模式
zh_hant: 索引模式

# SettingsPage_Scan_IndexMode.Description
source: Set the indexing method for the software during scanning; the indexing may affect the scanning speed.
zh_hans: 设置软件在扫描时的索引方式，索引可能会影响扫描速度
zh_hant: 設置軟件在掃描時的索引方式，索引可能會影響掃描速度

# SettingsPage_Scan_IndexMode_Parallel.Content
source: Parallel
zh_hans: 并行
zh_hant: 並行

# SettingsPage_Scan_IndexMode_After.Content
source: Independent
zh_hans: 独立

# SettingsPage_Scan_IndexMode_FastIndex.Header
source: Try a faster indexing method
zh_hans: 尝试使用更快的索引方式

# SettingsPage_Scan_IndexMode_FastIndex.Description
source: Try a faster indexing method on supported partition formats
zh_hans: 在支持的分区格式上尝试使用更快的索引方式

# InterceptWindow_Title.Title
source: Threat Detected
zh_hans: 发现威胁
zh_hant: 發現威脅

# InterceptWindow_ThreatTitle.Text
source: Threat detected
zh_hans: 检测到安全威胁
zh_hant: 檢測到安全威脅

# InterceptWindow_ThreatSubtitle.Text
source: Suspicious program intercepted
zh_hans: 已拦截可疑程序，请立即处理
zh_hant: 已攔截可疑程序，請立即處理

# InterceptWindow_ThreatTypeLabel.Text
source: Threat Type
zh_hans: 威胁类型
zh_hant: 威脅類型

# InterceptWindow_ThreatType_Default.Text
source: Trojan
zh_hans: 木马程序
zh_hant: 木馬程序

# InterceptWindow_ThreatLevelLabel.Text
source: Threat Level
zh_hans: 威胁等级
zh_hant: 威脅等級

# InterceptWindow_ThreatLevel_High.Text
source: High
zh_hans: 高危
zh_hant: 高危

# InterceptWindow_DetectionTimeLabel.Text
source: Detection Time
zh_hans: 拦截时间
zh_hant: 攔截時間

# InterceptWindow_SecurityAdviceLabel.Text
source: Security Advice
zh_hans: 安全建议
zh_hant: 安全建議

# InterceptWindow_SecurityAdviceText.Text
source: It is recommended to quarantine this file immediately.
zh_hans: 建议立即隔离该文件，防止恶意程序继续运行
zh_hant: 建議立即隔離該文件，防止惡意程序繼續運行

# InterceptWindow_ProtectionModuleLabel.Text
source: Protection module
zh_hans: 防护模块

# InterceptWindow_Module_Process
source: Process protection
zh_hans: 进程防护

# InterceptWindow_Module_File
source: File protection
zh_hans: 文件防护

# InterceptWindow_Module_Injection
source: Injection protection
zh_hans: 注入防护

# InterceptWindow_Module_Behavior
source: Behavior protection
zh_hans: 行为防护

# InterceptWindow_Module_Boot
source: Boot protection
zh_hans: 引导防护

# InterceptWindow_Module_Registry
source: Registry protection
zh_hans: 注册表防护

# InterceptWindow_Module_SelfProtection
source: Self protection
zh_hans: 自我防护

# InterceptWindow_Module_Unknown
source: Real-time protection
zh_hans: 实时防护

# InterceptWindow_Backend_Driver
source: Driver mode
zh_hans: 驱动模式

# InterceptWindow_Backend_Compatibility
source: Compatibility mode
zh_hans: 兼容模式

# InterceptWindow_TrustButton.Content
source: Restore & Trust
zh_hans: 恢复并信任
zh_hant: 恢復並信任

# InterceptWindow_TrustOnly.Text
source: Only Trust
zh_hans: 仅信任此文件
zh_hant: 僅信任此文件

# InterceptWindow_RestoreOnly.Text
source: Only Restore
zh_hans: 仅恢复此文件
zh_hant: 僅恢復此文件

# InterceptWindow_Message_TrustFailed_Title
source: Trust Failed
zh_hans: 信任失败
zh_hant: 信任失敗

# InterceptWindow_Message_TrustFailed_Body
source: Unable to add file to trust.
zh_hans: 无法将文件加入信任。
zh_hant: 無法將文件加入信任。

# InterceptWindow_Message_Trusted_Title
source: Trusted
zh_hans: 已信任
zh_hant: 已信任

# InterceptWindow_Message_Trusted_Body
source: File {0} has been added to trust.
zh_hans: 文件 {0} 已被加入信任。
zh_hant: 文件 {0} 已被加入信任。

# InterceptWindow_Message_RestoreFailed_Title
source: Restore Failed
zh_hans: 恢复失败
zh_hant: 恢復失敗

# InterceptWindow_Message_RestoreFailed_Body
source: Unable to restore file.
zh_hans: 无法恢复文件。
zh_hant: 無法恢復文件。

# InterceptWindow_Message_Restored_Title
source: Restored
zh_hans: 已恢复
zh_hant: 已恢復

# InterceptWindow_Message_Restored_Body
source: File {0} has been restored.
zh_hans: 文件 {0} 已恢复。
zh_hant: 文件 {0} 已恢復。

# InterceptWindow_Message_Exists_Title
source: Exists
zh_hans: 已存在
zh_hant: 已存在

# InterceptWindow_Message_Exists_Body
source: Target path already contains a file; cannot restore from quarantine.
zh_hans: 目标路径已有文件，无法从隔离恢复。
zh_hant: 目標路徑已有文件，無法從隔離恢復。

# InterceptWindow_ReleaseButton.Content
source: Release
zh_hans: 放行
zh_hant: 放行

# SettingsPage_Appearance_Nav_IsPaneToggleButtonInTitleBar.Header
source: Compact UI
zh_hans: 紧凑的界面
zh_hant: 緊湊的界面

# SettingsPage_Appearance_Nav_IsPaneToggleButtonInTitleBar.Description
source: Place the PaneToggleButton in the TitleBar
zh_hans: 将导航按钮置于标题栏
zh_hant: 將導航按鈕置於標題欄

# SettingsPage_Appearance_Nav_IsBackButtonVisible.Header
source: Back Button
zh_hans: 返回按钮

# SettingsPage_Appearance_Nav_IsBackButtonVisible.Description
source: Show a back button in the title bar or navigation bar
zh_hans: 在标题栏或导航栏中显示返回按钮

# SecurityPage_Model_InitFailed_Title
source: Cannot initialize Xdows Model
zh_hans: 无法初始化 Xdows Model

# Button_Skip
source: Skip
zh_hans: 跳过

# SecurityPage_ArchivePassword_Title
source: Archive is password protected
zh_hans: 压缩包受密码保护

# SecurityPage_ArchivePassword_Placeholder
source: Please enter password
zh_hans: 请输入密码

# SettingsPage_Appearance_Sound.Header
source: Control Sound Effects
zh_hans: 控件音效

# SettingsPage_Appearance_Sound.Description
source: Enable sound effects for control interactions
zh_hans: 启用控件交互时的音效反馈

# SettingsPage_Appearance_Sound_SpatialAudio.Header
source: Spatial Audio
zh_hans: 空间音频

# SettingsPage_Appearance_Sound_SpatialAudio.Description
source: Enable 3D spatial audio effects
zh_hans: 启用 3D 空间音效效果

# TitleBarMenu_Restore.Text
source: Restore
zh_hans: 还原

# TitleBarMenu_Move.Text
source: Move
zh_hans: 移动

# TitleBarMenu_Size.Text
source: Size
zh_hans: 大小

# TitleBarMenu_Minimize.Text
source: Minimize
zh_hans: 最小化

# TitleBarMenu_Maximize.Text
source: Maximize
zh_hans: 最大化

# TitleBarMenu_Close.Text
source: Close
zh_hans: 关闭

# SettingsPage_Other_About_Developer.Header
source: Developer
zh_hans: 开发团队

# SettingsPage_Other_ContextMenuScan.Header
source: Context Menu Scan
zh_hans: 右键菜单扫描

# SettingsPage_Other_ContextMenuScan.Description
source: Add a scan option to the file and folder context menu
zh_hans: 在文件和文件夹的右键菜单中添加扫描选项

# ContextMenu_ScanWith
source: Scan with Xdows Security
zh_hans: 使用 Xdows Security 扫描

# HomePage_LogSearch.PlaceholderText
source: Search logs
zh_hans: 搜索日志

# HomePage_LogManage.Text
source: Manage
zh_hans: 管理

# HomePage_ExportLogOptions.Text
source: Export options
zh_hans: 导出选项

# LogManagementDialog_Dialog.Title
source: Log Management
zh_hans: 日志管理

# LogManagementDialog_DeleteSelected.Text
source: Delete selected
zh_hans: 删除选中

# LogManagementDialog_DeleteAll.Text
source: Delete all
zh_hans: 删除全部

# LogManagementDialog_Loading.Text
source: Loading
zh_hans: 加载中

# LogExportDialog_Dialog.Title
source: Export Logs
zh_hans: 导出日志

# LogExportDialog_DateRange.Text
source: Date range
zh_hans: 日期范围

# LogExportDialog_LevelFilter.Text
source: Level filter
zh_hans: 级别过滤

# LogExportDialog_Keyword.Text
source: Keyword
zh_hans: 关键词

# LogExportDialog_Export.Content
source: Export
zh_hans: 导出

# LogExportDialog_FromDate.PlaceholderText
source: Start date
zh_hans: 开始日期

# LogExportDialog_ToDate.PlaceholderText
source: End date
zh_hans: 结束日期

# LogExportDialog_KeywordBox.PlaceholderText
source: Optional keyword filter
zh_hans: 可选关键词过滤

# LogExportDialog_Failed_Title
source: Log export failed
zh_hans: 导出日志失败

# LogExportDialog_Failed_Message
source: Unable to export logs: {0}
zh_hans: 无法导出日志：{0}

# UsbScanWindow_Title.Title
source: USB Device Scan
zh_hans: USB 设备扫描

# UsbScanWindow_Status_Scanning.Text
source: Scanning...
zh_hans: 正在扫描...

# UsbScanWindow_Status_Paused.Text
source: Paused
zh_hans: 已暂停

# UsbScanWindow_Status_Safe.Text
source: Safe
zh_hans: 安全

# UsbScanWindow_Status_ThreatsFound.Text
source: {0} threat(s) found
zh_hans: 发现 {0} 个威胁

# UsbScanWindow_Status_Cancelled.Text
source: Cancelled
zh_hans: 已取消

# UsbScanWindow_FilesScanned.Text
source: Files scanned
zh_hans: 已扫描文件

# UsbScanWindow_ThreatsFound.Text
source: Threats found
zh_hans: 发现威胁

# UsbScanWindow_Result_Safe.Text
source: No threats found
zh_hans: 未发现威胁

# UsbScanWindow_Result_Threats.Text
source: {0} threat(s) found
zh_hans: 发现 {0} 个威胁

# UsbScanWindow_Result_ThreatsDetail.Text
source: Click "View Threats" to handle
zh_hans: 点击"查看威胁"处理

# UsbScanWindow_Result_Cancelled.Text
source: Scan cancelled
zh_hans: 扫描已取消

# UsbScanWindow_OpenDevice.Content
source: Open Device
zh_hans: 打开设备

# UsbScanWindow_ViewThreats.Content
source: View Threats
zh_hans: 查看威胁

# UsbScanWindow_Pause.Content
source: Pause
zh_hans: 暂停

# UsbScanWindow_Resume.Content
source: Resume
zh_hans: 继续

# UsbScanWindow_Cancel.Content
source: Cancel
zh_hans: 取消

# SettingsPage_UsbAutoScan.Header
source: USB Auto Scan
zh_hans: USB 自动扫描

# SettingsPage_UsbAutoScan.Description
source: Automatically scan when removable device is detected
zh_hans: 检测到可移动设备时自动扫描

# SettingsPage_Appearance_Transition.Header
source: Page Transition
zh_hans: 页面过渡

# SettingsPage_Appearance_Transition.Description
source: Set the animation effect when switching between pages
zh_hans: 设置页面切换时的动画效果

# SettingsPage_Appearance_Transition_Default.Content
source: Default
zh_hans: 默认

# SettingsPage_Appearance_Transition_Entrance.Content
source: Entrance
zh_hans: 进入

# SettingsPage_Appearance_Transition_DrillIn.Content
source: Drill In
zh_hans: 钻入

# SettingsPage_Appearance_Transition_Suppress.Content
source: Suppress
zh_hans: 无动画

# SettingsPage_Appearance_Transition_SlideFromRight.Content
source: Slide from Right
zh_hans: 从右滑入

# SettingsPage_Appearance_Transition_SlideFromLeft.Content
source: Slide from Left
zh_hans: 从左滑入

# SettingsPage_Appearance_Transition_Continuum.Content
source: Continuum
zh_hans: 连续

# SettingsPage_Protection_Driver.Header
source: Driver Protection
zh_hans: 驱动防护

# SettingsPage_Protection_Driver.Description
source: Use the Xdows Security kernel driver for process, file, injection, and self-protection
zh_hans: 使用 Xdows Security 内核驱动接管进程、文件、注入和自保护

# SettingsPage_Protection_Injection.Header
source: Injection Protection
zh_hans: 注入防护

# SettingsPage_Protection_Injection.Description
source: Block cross-process injection; when disabled, injection behaviors are allowed directly
zh_hans: 拦截跨进程注入行为；关闭后注入类行为将直接放行

# SettingsPage_Protection_Driver_Status_NotInstalled
source: Not installed
zh_hans: 未安装

# SettingsPage_Protection_Driver_Status_NotRunning
source: Not running
zh_hans: 未运行

# SettingsPage_Protection_Driver_Status_Loading
source: Loading
zh_hans: 加载中

# SettingsPage_Protection_Driver_Status_Protected
source: Protected by driver
zh_hans: 驱动已保护

# SettingsPage_Protection_Driver_Status_NeedsRepair
source: Needs repair
zh_hans: 需要修复

# SettingsPage_Protection_Driver_Status_Error
source: Error
zh_hans: 错误

# DriverEnvironmentDialog_Title
source: Driver environment check
zh_hans: 驱动环境检测

# DriverEnvironmentDialog_Close
source: Close
zh_hans: 关闭

# DriverEnvironmentDialog_Refresh
source: Refresh
zh_hans: 刷新

# DriverEnvironmentDialog_Checking
source: Checking driver protection environment...
zh_hans: 正在检查驱动防护环境...

# DriverEnvironmentDialog_Repairing
source: Repairing {0}...
zh_hans: 正在修复 {0}...

# DriverEnvironmentDialog_Summary_Healthy
source: Driver protection environment is ready.
zh_hans: 驱动防护环境就绪。

# DriverEnvironmentDialog_Summary_NeedsAttention
source: Driver protection needs attention. Use the repair actions below, or keep compatibility protection enabled until the driver is healthy.
zh_hans: 驱动防护需要关注。请使用下方修复操作，或在驱动就绪前保持兼容防护启用。

# DriverEnvironmentDialog_Summary_Error
source: Unable to complete the driver environment check. Keep compatibility protection enabled and inspect the logs.
zh_hans: 无法完成驱动环境检测。请保持兼容防护启用并检查日志。

# DriverEnvironmentDialog_Status_Passed
source: Passed
zh_hans: 通过

# DriverEnvironmentDialog_Status_Warning
source: Warning
zh_hans: 警告

# DriverEnvironmentDialog_Status_Failed
source: Failed
zh_hans: 失败

# DriverEnvironmentDialog_Group_Privileges_Title
source: Privileges
zh_hans: 运行权限

# DriverEnvironmentDialog_Group_Signing_Title
source: Driver signing and system policy
zh_hans: 驱动签名与系统策略

# DriverEnvironmentDialog_Group_Packages_Title
source: Driver packages and services
zh_hans: 双驱动包及服务

# DriverEnvironmentDialog_Group_Runtime_Title
source: Driver communication and model assets
zh_hans: 双驱动通信与模型资源

# SettingsPage_Protection_Driver_Dialog_Title
source: Driver environment check required
zh_hans: 需要检测驱动环境

# SettingsPage_Protection_Driver_Dialog_Content
source: The driver could not be started. Check administrator permission, driver installation, test-signing/signature state, service status, and native model files.
zh_hans: 驱动未能启动。请检查管理员权限、驱动安装、测试签名/正式签名状态、服务状态和原生模型文件。

# SettingsPage_Protection_Driver_Disclaimer_Title
source: Driver protection disclaimer
zh_hans: 驱动防护免责声明

# SettingsPage_Protection_Driver_Disclaimer_Text
source: Driver protection installs and starts a kernel-mode driver. It can block process, file, injection, and self-protection events before they reach user mode. Use it only when you understand that an incorrect decision, unsigned driver state, incompatible system policy, or third-party security software may affect system stability. Continue only if you accept this risk.
zh_hans: 驱动防护会安装并启动内核模式驱动，可在事件到达用户态之前拦截进程、文件、注入和自保护行为。错误决策、未签名驱动状态、不兼容的系统策略或第三方安全软件都可能影响系统稳定性。仅在理解并接受这些风险后继续。

# SettingsPage_Protection_Driver_Setup_Status
source: Configuring
zh_hans: 配置中

# SettingsPage_Protection_Driver_Setup_Title
source: Configuring driver protection
zh_hans: 正在配置驱动防护

# SettingsPage_Protection_Driver_Setup_Preparing
source: Preparing driver protection
zh_hans: 准备驱动防护

# SettingsPage_Protection_Driver_Setup_Preparing_Detail
source: Checking consent and preparing the protection runtime.
zh_hans: 正在检查授权状态并准备防护运行时。

# SettingsPage_Protection_Driver_Setup_Checking
source: Checking driver package
zh_hans: 检查驱动包

# SettingsPage_Protection_Driver_Setup_Checking_Detail
source: Looking for the built driver files copied by the solution build.
zh_hans: 正在查找由解决方案构建复制的驱动文件。

# SettingsPage_Protection_Driver_Setup_Configuring
source: Installing and starting driver
zh_hans: 安装并启动驱动

# SettingsPage_Protection_Driver_Setup_Configuring_Detail
source: Registering the device, installing the INF package, starting the service, and connecting the bridge.
zh_hans: 正在注册设备、安装 INF 包、启动服务并连接桥接通道。

# SettingsPage_Protection_Driver_Setup_Finalizing
source: Finalizing driver protection
zh_hans: 完成驱动防护配置

# SettingsPage_Protection_Driver_Setup_Finalizing_Detail
source: Refreshing protection status and applying the driver-backed mode.
zh_hans: 正在刷新防护状态并应用驱动防护模式。

# SettingsPage_Protection_Driver_Setup_Success
source: Driver protection is enabled.
zh_hans: 驱动防护已启用。

# SettingsPage_Protection_Driver_Setup_Failed
source: Driver protection could not be enabled. Opening the environment check.
zh_hans: 驱动防护未能启用。即将打开环境检测。

# SecurityPage_Details_FamilyName
source: Threats Family:
zh_hans: 威胁家族：

# SecurityPage_Details_OpenButton
source: Open File
zh_hans: 打开文件

# SecurityPage_Risk_Title
source: Risk Warning
zh_hans: 风险提示

# SecurityPage_Risk_ArchiveContent
source: Do you want to open this file with the default program on this device: {0} This action may cause you to accidentally run a threat file.
zh_hans: 是否使用此设备默认程序打开此文件： {0} 该操作可能会导致您意外运行威胁文件

# SecurityPage_Risk_FileContent
source: Do you want to select this file with File Explorer: {0} This action may cause you to accidentally run a threat file.
zh_hans: 是否使用 文件资源管理器 选中此文件： {0} 该操作可能会导致您意外运行威胁文件

# SecurityPage_Risk_Allow
source: Allow
zh_hans: 允许

# ProcessManager_DriverModeToggle.OffContent
source: Driver mode
zh_hans: 驱动模式

# ProcessManager_DriverModeToggle.OnContent
source: Driver mode
zh_hans: 驱动模式

# ProcessManager_DriverMode_RequiresProtection_Title
source: Driver protection is required
zh_hans: 需要启用驱动防护

# ProcessManager_DriverMode_RequiresProtection_Text
source: You must start driver protection before enabling driver mode. Go to Settings - Protection and enable Driver protection first.
zh_hans: 用户需要启动驱动防护才能打开驱动模式。请先前往“设置 - 防护”启用驱动防护。

# ProcessManager_DriverMode_Disclaimer_Title
source: Process manager driver mode disclaimer
zh_hans: 进程管理驱动模式免责声明
